{
  "Hydration & Skin Barrier Support": {
    "high_score": "This product provides exceptional hydration and barrier support, featuring key ingredients like {star_ingredients}.",
    "medium_score": "This product offers good support for skin hydration, containing helpful ingredients such as {star_ingredients}.",
    "low_score": "Hydration is not the primary focus of this product, though it contains some beneficial ingredients.",
    "benefits": {}
  },
  "Brightening & Even Skin Tone": {
    "high_score": "This product is exceptionally formulated for brightening and evening out skin tone, with {star_ingredients} as the star ingredients.",
    "medium_score": "This product can contribute to a brighter skin tone thanks to ingredients like {star_ingredients}.",
    "low_score": "This formula is not primarily focused on brightening or addressing hyperpigmentation.",
    "benefits": {}
  },
  "Soothing & Redness Reduction": {
    "high_score": "This is a strong formula for calming the skin and reducing redness, featuring soothing agents like {star_ingredients}.",
    "medium_score": "This product offers moderate soothing benefits, containing ingredients such as {star_ingredients}.",
    "low_score": "Soothing is not a primary function of this product.",
    "benefits": {}
  },
  "Pore Appearance & Texture Improvement": {
    "high_score": "This product is highly effective for improving skin texture and the appearance of pores, driven by key ingredients like {star_ingredients}.",
    "medium_score": "This formula provides some benefits for skin texture, including ingredients like {star_ingredients}.",
    "low_score": "This product is not designed to address texture or pore appearance.",
    "benefits": {}
  },
  "Anti-aging & Wrinkle Reduction": {
    "high_score": "This is a powerful anti-aging formula, featuring proven ingredients like {star_ingredients} to address fine lines and wrinkles.",
    "medium_score": "This product offers moderate anti-aging support with ingredients such as {star_ingredients}.",
    "low_score": "Anti-aging is not the main goal of this formula.",
    "benefits": {}
  }
}